tap "aws/tap"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "libsql/sqld"
tap "mongodb/brew"
tap "nikitabobko/tap"
tap "supabase/tap"
tap "tursodatabase/tap"
tap "weaveworks/tap"

# Core utilities
brew "openssl@3"
brew "coreutils"
brew "git"
brew "tmux"
brew "tree"
brew "watch"
brew "zip"

# CLI tools
brew "ansifilter"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "glab"
brew "jp"
brew "peco"
brew "ripgrep"
brew "sshpass"

# Development
brew "ansible", link: false
brew "cocoapods"
brew "docker", link: false
brew "docker-compose"
brew "neovim"
brew "node"
brew "node@20"
brew "pnpm"

# Cloud & Infrastructure
brew "argocd"
brew "aws-sam-cli"
brew "awscli"
brew "cfn-lint"
brew "eksctl"
brew "helm"
brew "k6"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "minikube"
brew "rain"
brew "tflint"
brew "tfenv"

# Languages
brew "goenv"
brew "pyenv"
brew "rbenv"
brew "mise"
brew "uv"

# Databases & ORMs
brew "postgresql@14", restart_service: :changed
brew "mongodb/brew/mongodb-community"
brew "mongosh"

# Libraries
brew "graphviz"
brew "imagemagick"
brew "cryptography"
brew "docutils"

# Shell & Prompt
brew "powerlevel10k"
brew "starship"

# Emacs & Misc
brew "emacs"
brew "newrelic-infra-agent"

# Casks
cask "alfred"
cask "android-studio"
cask "arc"
cask "claude"
cask "claude-code"
cask "cmux"
cask "cursor"
cask "docker-desktop"
cask "flutter"
cask "font-caskaydia-cove-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "gitbutler"
cask "google-japanese-ime"
cask "launchcontrol"
cask "microsoft-remote-desktop"
cask "ngrok"
cask "visual-studio-code"
cask "wezterm@nightly"
cask "wireshark-app"
